
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Остатки.Очистить();
	
	// регистр Остатки Приход
	Движения.Остатки.Записывать = Истина;
	Движения.Остатки.БлокироватьДляИзменения = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Номенклатура.ТипТовара = Перечисления.ТипыТовара.Услуга Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.Остатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	
	Движения.Партии.Очистить();
	
	// регистр Партии Приход
	Движения.Партии.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Если ТекСтрокаТовары.Номенклатура.ТипТовара = Перечисления.ТипыТовара.Услуга Тогда
			Продолжить;
		КонецЕсли;
		Движение = Движения.Партии.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Партия = Ссылка;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Стоимость = ТекСтрокаТовары.Стоимость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
